api/app/controllers/projects_controller.rb

    def index
        projects = Project.all
---
SELECT "projects".* FROM "projects"

    def show
        project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def get_team_projects
        user_id = params[:id]
        teams = Team.includes(:users, :projects)
        .where(users: {id: user_id})
---
SELECT projects.*, "users"."name" FROM "projects" INNER JOIN "teams" ON "teams"."id" = "projects"."team_id" INNER JOIN "user_projects" ON "user_projects"."project_id" = "projects"."id" INNER JOIN "users" ON "users"."id" = "user_projects"."user_id" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def get_users_in_project
        project_id = params[:id]
        users = User.joins(:projects)
        .where(projects: {id: project_id})
        .select("users.id", "users.name")
---
SELECT "users"."id", "users"."name" FROM "users" INNER JOIN "user_projects" ON "user_projects"."user_id" = "users"."id" INNER JOIN "projects" ON "projects"."id" = "user_projects"."project_id" WHERE "projects"."id" = $1  [["id", 1]]

    def get_tasklists_for_project
        project_id = params[:id]
        tasklists = TaskList.where(project_id: project_id)
        .order(column_index: :asc)
        .includes(tasks: :user)
     if tasklists.present?
---
SELECT "task_lists".* FROM "task_lists" INNER JOIN "projects" ON "projects"."id" = "task_lists"."project_id" WHERE "projects"."id" = $1 ORDER BY "task_lists"."column_index" ASC  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
SELECT 1 AS one FROM "task_lists" WHERE "task_lists"."project_id" = $1 LIMIT $2  [["project_id", 1], ["LIMIT", 1]]
SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."project_id" = $1 ORDER BY "task_lists"."column_index" ASC  [["project_id", 1]]

    def create_tasklist
        project = Project.find(params[:id])
        tasklist = project.task_lists.create(tasklist_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "task_lists" ("name", "project_id", "created_at", "updated_at", "column_index", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "debugging"], ["project_id", 2], ["created_at", "2023-06-22 21:52:09.698373"], ["updated_at", "2023-06-22 21:52:09.698373"], ["column_index", nil], ["user_id", 1]]