api/app/controllers/task_lists_controller.rb

SELECT "task_lists".* FROM "task_lists"
---
    def index
        tasklists = TaskList.all

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_tasks_for_tasklist
        tasklist = TaskList.find(params[:id])

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "task_list_id", "user_id", "project_id", "description", "due_date", "completed", "completed_at", "created_at", "updated_at", "task_index") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create_task
        tasklist = TaskList.find(params[:id])
        task = tasklist.tasks.create!(task_params)

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "task_lists" WHERE "task_lists"."id" = $1  [["id", 1]]
---
    def destroy
        tasklist = TaskList.find(params[:id])
        tasklist.destroy

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "task_lists" SET "updated_at" = $1, "column_index" = $2 WHERE "task_lists"."id" = $3  [["updated_at", "2023-06-23 08:38:25.430085"], ["column_index", 2], ["id", 2]]
---
    def edit_columnIndex
        tasklist = TaskList.find(params[:id])
        if tasklist.update(column_index: params[:id])

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "task_lists" SET "name" = $1, "updated_at" = $2 WHERE "task_lists"."id" = $3  [["name", "Completed"], ["updated_at", "2023-06-23 08:49:19.641587"], ["id", 2]]
---
    def update_tasklist_name
        tasklist = TaskList.find(params[:id])
        if tasklist.update(name: params[:name])