api/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def index
        tasks = Task.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
        task = Task.includes(:project, :user, comments: :user).find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_tasks_for_user
        user = User.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "task_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "I'll work on this soon"], ["task_id", 1], ["user_id", 1], ["created_at", "2023-06-23 09:45:10.829348"], ["updated_at", "2023-06-23 09:45:10.829348"]]
---
        task = Task.find(params[:id])
        comment = task.comments.build(comment_params)
        if comment.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = $1 ORDER BY "comments"."id" ASC  [["task_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
        task = Task.find(params[:id])
        comments = task.comments.includes(:user).order(id: :asc)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "task_list_id" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["task_list_id", 2], ["updated_at", "2023-06-23 11:05:07.270786"], ["id", 1]]
---
        task = Task.find(params[:id])
        task.update(tasklist_id: params[:tasklist_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "project_id" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["project_id", 2], ["updated_at", "2023-06-23 11:22:30.028353"], ["id", 1]]
---
        task = Task.find(params[:id])
        task.update(project_id: params[:project_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "user_id" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["user_id", 2], ["updated_at", "2023-06-23 11:24:58.749301"], ["id", 1]]
---
        task = Task.find(params[:id])
        task.update(user_id: params[:user_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "task_index" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2023-06-23 11:50:07.488929"], ["task_index", 1], ["id", 1]]
---
    task = Task.find(params[:id])
    # parse task index as integer
    task_index = params[:task_index].to_i
    if task.update(task_index: task_index)