api/app/controllers/teams_controller.rb

    def index
        teams = Team.all
---
SELECT "teams".* FROM "teams"

    def show
        team = Team.includes(:projects, :users).find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."team_id" = $1  [["team_id", 1]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = $1  [["team_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]

    def get_team_users
        team = Team.includes(:users).find(params[:id])
        users = team.users.select(:id, :name, :email)
---
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = $1  [["team_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]
SELECT "users"."id", "users"."name", "users"."email" FROM "users" INNER JOIN "user_teams" ON "users"."id" = "user_teams"."user_id" WHERE "user_teams"."team_id" = $1  [["team_id", 1]]

    def get_teams_user
        user = User.find(params[:id])
        teams = user.teams.select(:name, :id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "teams"."name", "teams"."id" FROM "teams" INNER JOIN "user_teams" ON "teams"."id" = "user_teams"."team_id" WHERE "user_teams"."user_id" = $1  [["user_id", 1]]

    def get_team_projects
        team = Team.includes(:projects).find(params[:id])
        projects = team.projects.select(:id,:name)
---
SELECT "projects".* FROM "projects" WHERE "projects"."team_id" = $1  [["team_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "projects"."id", "projects"."name" FROM "projects" WHERE "projects"."team_id" = $1  [["team_id", 1]]

    def add_user_to_team
        team_id = params[:teamId]
        user_id = params[:userId]
        userteam = UserTeam.find_by(team_id: team_id, user_id: user_id)
        if userteam.present?
            render json: {error: "User already added to team"}, status: :conflict
        else
            new_user_team = UserTeam.create(user_id: user_id, team_id: team_id)
---
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = $1 AND "user_teams"."user_id" = $2 LIMIT $3  [["team_id", 1], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "user_teams" ("user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["team_id", 1], ["created_at", "2023-06-23 13:51:08.793057"], ["updated_at", "2023-06-23 13:51:08.793057"]]

    def update_description
        team_id = params[:teamId]
        description = params[:description]
        team = Team.find_by(id: team_id)
        if team
            team.update(description: description)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teams" SET "description" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["description", "This is team engineering"], ["updated_at", "2023-06-23 14:02:29.407860"], ["id", 1]]

    def create_project_for_team
        team_id = params[:id]
        name = params[:name]
        user_id = params[:userId]
        team = Team.find_by(id: team_id)
        if team
            project = team.projects.create(name: name)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "projects" ("name", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "create a project management tool"], ["team_id", 3], ["created_at", "2023-06-23 14:25:42.694746"], ["updated_at", "2023-06-23 14:25:42.694746"]]

    def destroy
        team = Team.find(params[:id])
        team.destroy
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 1]]