api/app/controllers/user_teams_controller.rb

SELECT "user_teams".* FROM "user_teams"
---
    def index
        userteams = UserTeam.all

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "user_teams" WHERE "user_teams"."id" = $1  [["id", 4]]
SELECT "user_teams".* FROM "user_teams" WHERE "user_teams"."team_id" = $1 AND "user_teams"."user_id" = $2  [["team_id", 2], ["user_id", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "user_teams" ON "users"."id" = "user_teams"."user_id" WHERE "user_teams"."team_id" = $1 LIMIT $2  [["team_id", 2], ["LIMIT", 1]]
---
    def leave_team
        team = Team.find(params[:teamId])
        user = User.find(params[:userId])
        UserTeam.where(team: team, user: user).destroy_all
        if team.users.empty?