api/app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("email", "name", "image", "password_digest", "created_at", "updated_at", "password_confirmation", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"